#include <iostream>

using std::cout;
using std::endl;

int main() {
    // условные обозначения:
    // let - создаем переменную
    // f() - вынести в отдельную функцию

    // let char board[3][3] - это матрица 3 х 3, отображающая текущее положение на доске
    // let enum PlayerType { TIC = 'X', TAC = '0' } - игроки
    // let char CurrentPlayer - текущий игрок

    // ШАГ 1:
    // делаем ход. Если ход сделал TIC, то ходит TAC. И наоборот.
    // соответственно сохраняем текущего игрока

    // ШАГ 2:
    // для хода, текущий пользователь должен ввести значение по линии и колонке.
    // значит - нужна проверка f().
    // ввел:
    // - a) не прошел валидацию: входим в цикл
    // - б) все ок: переходим к следующему шагу

    // ШАГ 3:
    // вносим изменения в board
    // отрисовываем board f()

    // ШАГ 4:
    // проверяем таблицу (пока не меняя её) с учетом нового знака f().
    // проверяем каждую линию и количество знаков.
    // Возвращаем результат. Это может быть сигнал:
    // - а) сообщение о победе текущего игрока
    // - б) сообщение о продолжении. Тогда переходим к ШАГ 1.
}